---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralFramingUtils
source: html/17e233e7-d975-6ed0-b86b-dbc5d1a918e2.htm
---
# StructuralFramingUtils Members

Sets the indicated end of the framing element to be allowed to join to others.